# Yuhe Wu
# week 12 - 2021/11/11 - 2021/11/16
# Python Pandas Series and Data Frame

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
mydataset = {
    'cars' : ['GMC','Toyota','Ford'],
    'seats': [8,7,3]
}
print(mydataset)
type(mydataset)

{'cars': ['GMC', 'Toyota', 'Ford'], 'seats': [8, 7, 3]}

dict

In [3]:
df1 = pd.DataFrame(mydataset)
df1

     cars  seats
0     GMC      8
1  Toyota      7
2    Ford      3

In [4]:
print(pd.__version__)

1.0.5

In [5]:
# panda Series
s = Series([2,3,5,6,8,9,10])
s

0     2
1     3
2     5
3     6
4     8
5     9
6    10
dtype: int64

In [6]:
s.values

array([ 2,  3,  5,  6,  8,  9, 10], dtype=int64)

In [7]:
s.index

RangeIndex(start=0, stop=7, step=1)

In [8]:
s[2]

5

In [9]:
# Create Labels
s = pd.Series([10,20,30,40], index=['w','x','y','z'])
print(s)

w    10
x    20
y    30
z    40
dtype: int64

In [10]:
print(s['y'])

30

In [11]:
# creating series from numpy array

d = np.array(['a','b','c','d'])
print(d)

['a' 'b' 'c' 'd']

In [12]:
s = Series(d,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [13]:
summer_olympic = Series([2520,1122,937,847,713], index=['USA','Russia','Germany','UK','France'])

summer_olympic

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [14]:
summer_olympic['USA']

2520

In [15]:
summer_olympic[summer_olympic>800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [16]:
'UK' in summer_olympic

True

In [17]:
# Convert Series to dictionary
summer_olympic_dc = summer_olympic.to_dict()

summer_olympic_dc

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [18]:
summer_olympic_Series = Series(summer_olympic_dc)
summer_olympic_Series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [19]:
countries = ['Russia','France','Spain','Germany','USA','UK','Italy']

In [20]:
s1 = Series(summer_olympic_dc, index=countries)

In [21]:
s1

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [22]:
pd.isnull(s1)

Russia     False
France     False
Spain       True
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [23]:
pd.notnull(s1)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [24]:
pd.notna(s1)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [25]:
summer_olympic_Series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [26]:
s1

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [27]:
summer_olympic_Series + s1

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
Spain         NaN
UK         1694.0
USA        5040.0
dtype: float64

In [28]:
s1.name = "summer_olympic"

In [29]:
s1

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: summer_olympic, dtype: float64

In [30]:
s1.index.name = 'Countries'

In [31]:
s1

Countries
Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: summer_olympic, dtype: float64

In [32]:
# DataFrame
data = {
    "calories":[420,380,390],
    "fruits": ['Orange','Banana','Grape']
}
df = DataFrame(data)
print(df)

   calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [33]:
df.loc[0]

calories       420
fruits      Orange
Name: 0, dtype: object

In [34]:
type(df.loc[0])

pandas.core.series.Series

In [35]:
df.loc[[0,1]]

   calories  fruits
0       420  Orange
1       380  Banana

In [36]:
type(df.loc[[0,1]])

pandas.core.frame.DataFrame

In [37]:
data_dict = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
            'year':[2000,2001,2002,2001,2002,2003],
            'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

df = pd.DataFrame(data_dict)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
df.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
DataFrame(data_dict,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [41]:
df2 = DataFrame(data_dict,columns=['year','state','pop'],
                index=['one','two','three','four','five','six'])

df2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [42]:
df3 = DataFrame(data_dict,columns=['year','state','pop','debt'],
                index=['one','two','three','four','five','six'])

df3

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [43]:
df3.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
df3['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [45]:
df3.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [46]:
df3.debt

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [47]:
df3.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
df3['debt'] = 10.5

df3

       year   state  pop  debt
one    2000    Ohio  1.5  10.5
two    2001    Ohio  1.7  10.5
three  2002    Ohio  3.6  10.5
four   2001  Nevada  2.4  10.5
five   2002  Nevada  2.9  10.5
six    2003  Nevada  3.2  10.5

In [49]:
df3['debt'] = np.arange(6.)
df3

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [50]:
# Assign a series values to one of the data frame columns
s = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
s

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [51]:
df2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [52]:
df2['debt'] = s
df2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [53]:
df2['eastern'] = df2['state'] == 'Ohio'
df2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [54]:
df2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [55]:
# delete column
del df2['eastern']
df2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [56]:
dc = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

dc

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [57]:
df = DataFrame(dc)
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [58]:
df.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [59]:
DataFrame(df,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [60]:
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [61]:
df['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [62]:
df['Ohio']

2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [63]:
df['Ohio'][:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [64]:
df['Nevada'][:1]

2001    2.4
Name: Nevada, dtype: float64

In [65]:
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [66]:
df.index.name='year'; df.columns.name='state'
df

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [67]:
data = {
    "calories":[420,380,390],
    "fruits":['Apple','Cherry','Banana']
}

df1 = DataFrame(data, index=['day1','day2','day3'])
df1

      calories  fruits
day1       420   Apple
day2       380  Cherry
day3       390  Banana

In [69]:
df1.loc['day2']   #loc = location

calories       380
fruits      Cherry
Name: day2, dtype: object